app/views/objectives/_form.html.erb

SELECT "perspectives".* FROM "perspectives"
---
    <%= f.label :perspective_id %><br />
    <%= f.collection_select :perspective_id, Perspective.all, :id, :name %>