app/views/objectives/index.html.erb

    <td><%= objective.weight %></td>
    <td><%= Perspective.find(objective.perspective_id).name %></td>
---
SELECT "perspectives".* FROM "perspectives" WHERE "perspectives"."id" = ? LIMIT 1  [["id", 1]]