app/views/objectives/show.html.erb

<h2>Indicadores</h2>
  <% @objective.indicators.size.times{|i| %>
---
SELECT "indicators".* FROM "indicators" INNER JOIN "indicators_objectives" ON "indicators"."id" = "indicators_objectives"."indicator_id" WHERE "indicators_objectives"."objective_id" = 1