app/views/perspective_scores/_form.html.erb

SELECT "perspectives".* FROM "perspectives"
---
    <%= f.label :perspective_id %><br />
    <%= f.collection_select :perspective_id, Perspective.all, :id, :name %>

SELECT "score_dates".* FROM "score_dates"
---
    <%= f.label :scoredate_id %><br />
    <%= f.collection_select :scoredate_id, ScoreDate.all, :id, :month %>