app/controllers/indicator_scores_controller.rb

  def show
    @indicator_score = IndicatorScore.find(params[:id])
---
SELECT "indicator_scores".* FROM "indicator_scores" WHERE "indicator_scores"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @indicator_score = IndicatorScore.new(params[:indicator_score])

    respond_to do |format|
      if @indicator_score.save
---
INSERT INTO "indicator_scores" ("created_at", "indicator_id", "score", "scoredate_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 26 May 2012 18:19:53 UTC +00:00], ["indicator_id", 1], ["score", 98.0], ["scoredate_id", 1], ["updated_at", Sat, 26 May 2012 18:19:53 UTC +00:00]]