app/controllers/indicators_controller.rb

SELECT "indicators".* FROM "indicators"
---
  def index
    @indicators = Indicator.all

SELECT "indicators".* FROM "indicators" WHERE "indicators"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @indicator = Indicator.find(params[:id])

SELECT "indicators".* FROM "indicators" WHERE "indicators"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @indicator = Indicator.find(params[:id])

INSERT INTO "indicators" ("created_at", "name", "objective_id", "updated_at", "weight") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 26 May 2012 18:01:16 UTC +00:00], ["name", "EVA del Grupo"], ["objective_id", 1], ["updated_at", Sat, 26 May 2012 18:01:16 UTC +00:00], ["weight", 100.0]]
---
  def create
    @indicator = Indicator.new(params[:indicator])

    respond_to do |format|
      if @indicator.save

SELECT "indicators".* FROM "indicators" WHERE "indicators"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @indicator = Indicator.find(params[:id])