app/controllers/objectives_controller.rb

SELECT "objectives".* FROM "objectives"
---
  def index
    @objectives = Objective.all

SELECT "objectives".* FROM "objectives" WHERE "objectives"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @objective = Objective.find(params[:id])

SELECT "objectives".* FROM "objectives" WHERE "objectives"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @objective = Objective.find(params[:id])

INSERT INTO "objectives" ("created_at", "name", "perspective_id", "updated_at", "weight") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 26 May 2012 16:29:49 UTC +00:00], ["name", "Maximizar el Valor del Grupo"], ["perspective_id", 1], ["updated_at", Sat, 26 May 2012 16:29:49 UTC +00:00], ["weight", 20.0]]
---
  def create
    @objective = Objective.new(params[:objective])

    respond_to do |format|
      if @objective.save