app/controllers/perspectives_controller.rb

SELECT "perspectives".* FROM "perspectives"
---
  def index
	@perspectives = Perspective.all

SELECT "perspectives".* FROM "perspectives" WHERE "perspectives"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @perspective = Perspective.find(params[:id])

SELECT "perspectives".* FROM "perspectives" WHERE "perspectives"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @perspective = Perspective.find(params[:id])

INSERT INTO "perspectives" ("created_at", "name", "score", "updated_at", "weight") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 25 May 2012 21:48:58 UTC +00:00], ["name", "Financiera"], ["score", 45.0], ["updated_at", Fri, 25 May 2012 21:48:58 UTC +00:00], ["weight", 25.0]]
---
  def create
    @perspective = Perspective.new(params[:perspective])

    respond_to do |format|
      if @perspective.save

SELECT "perspectives".* FROM "perspectives" WHERE "perspectives"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "perspectives" SET "name" = 'Desarrollo y Crecimiento', "updated_at" = '2012-05-26 17:13:05.781837' WHERE "perspectives"."id" = 4
---
  def update
    @perspective = Perspective.find(params[:id])

    respond_to do |format|
      if @perspective.update_attributes(params[:perspective])