app/controllers/perspective_scores_controller.rb

  def index
    @perspective_scores = PerspectiveScore.all
---
SELECT "perspective_scores".* FROM "perspective_scores"