app/controllers/score_dates_controller.rb

  def index
    @score_dates = ScoreDate.all
---
SELECT "score_dates".* FROM "score_dates"

  def show
    @score_date = ScoreDate.find(params[:id])
---
SELECT "score_dates".* FROM "score_dates" WHERE "score_dates"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @score_date = ScoreDate.new(params[:score_date])

    respond_to do |format|
      if @score_date.save
---
INSERT INTO "score_dates" ("created_at", "month", "updated_at", "year") VALUES (?, ?, ?, ?)  [["created_at", Sat, 26 May 2012 16:26:57 UTC +00:00], ["month", 5], ["updated_at", Sat, 26 May 2012 16:26:57 UTC +00:00], ["year", 2012]]