app/views/indicators/_form.html.erb


  <% for objective in Objective.all %>
        <div>
          <%= check_box_tag "indicator[objective_ids][]", objective.id, @indicator.objectives.include?(objective) %>
---
SELECT "objectives".* FROM "objectives"
SELECT 1 FROM "objectives" INNER JOIN "indicators_objectives" ON "objectives"."id" = "indicators_objectives"."objective_id" WHERE "indicators_objectives"."indicator_id" = 1 AND "objectives"."id" = 1 LIMIT 1