app/views/indicators/index.html.erb

SELECT "objectives".* FROM "objectives" WHERE "objectives"."id" = ? LIMIT 1  [["id", 1]]
---
    <td><%= indicator.weight %></td>
    <td><%= Objective.find(indicator.objective_id).name %></td>