app/views/indicator_scores/_form.html.erb

SELECT "indicators".* FROM "indicators"
---
    <%= f.label :indicator_id %><br />
    <%= f.collection_select :indicator_id, Indicator.all, :id, :name %>

SELECT "score_dates".* FROM "score_dates"
---
    <%= f.label :scoredate_id %><br />
    <%= f.collection_select :scoredate_id, ScoreDate.all, :id, :month %>