app/views/indicator_scores/index.html.erb

SELECT "indicators".* FROM "indicators" WHERE "indicators"."id" = ? LIMIT 1  [["id", 1]]
---
  <tr>
    <td><%= Indicator.find(indicator_score.indicator_id).name %></td>